<template>
  <div class="wrapper">
    <ul class="content">
      <h2>---------star--------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------</h2>
      <h2>---------end----------</h2>
    </ul>
  </div>
</template>

<script>
  import BScroll from 'better-scroll'

  export default {
    name: "Category",
    data() {
      return {
        scroll: null
      }
    },
    //组件创建完后调用
    created() {

    },
    mounted() {
      this.scroll = new BScroll(document.querySelector('.wrapper'), {

      })
    }
  }
</script>

<style scoped>
  .wrapper {
    height: 100px;
    background-color: red;

       overflow: hidden;
    /*    overflow-y: scroll; */
  }
</style>
